(
  [
    ,
    ウ,                          // "o"
    ,
    ,
    ,
    ア                           // "c"
  ] =

  [] + {},                       // "[object Object]"

  [
    ネ,                          // "t"
    ホ,                          // "r"
    ヌ,                          // "u"
    セ,                          // "e"
    ,
    ミ,                          // "a"
    ハ,                          // "l"
    ヘ,                          // "s"
    ,
    ,
    ナ                           // "n"
  ] =
  [!!ウ] +                       // "true" +
  !ウ +                          // "false" +
  ウ.ウ                          // "undefined"
)[
  ツ =
  ア+ウ+ナ+ヘ+ネ+ホ+ヌ+ア+ネ+ウ+ホ  // "constructor"
][
  ツ                             // "constructor"
](
  ミ+ハ+セ+ホ+ネ+                  // "alert"
  '(-~ウ)'                       // (1)
)()